In [19]:
import psycopg2 as pg
import pandas as pd

connection = pg.connect(host='pgsql-196447.vipserv.org', port=5432, dbname='wbauer_adb', user='wbauer_adb', password='adb2020')

**Zadanie 1**

In [20]:
df = pd.read_sql('select category_id from category order by category_id  desc  limit 1 ',con=connection)
df

c:\Users\kasia\anaconda3\envs\KatarzynaWcislo\lib\site-packages\pandas\io\sql.py:761: UserWarning: pandas only support SQLAlchemy connectable(engine/connection) ordatabase string URI or sqlite3 DBAPI2 connectionother DBAPI2 objects are not tested, please consider using SQLAlchemy
  warnings.warn(

   category_id
0           16

Mamy 16 kategorii filmów.

**Zadanie 2**

In [21]:
df = pd.read_sql('select * from category order by name',con=connection)
df

c:\Users\kasia\anaconda3\envs\KatarzynaWcislo\lib\site-packages\pandas\io\sql.py:761: UserWarning: pandas only support SQLAlchemy connectable(engine/connection) ordatabase string URI or sqlite3 DBAPI2 connectionother DBAPI2 objects are not tested, please consider using SQLAlchemy
  warnings.warn(

    category_id         name         last_update
0             1       Action 2006-02-15 09:46:27
1             2    Animation 2006-02-15 09:46:27
2             3     Children 2006-02-15 09:46:27
3             4     Classics 2006-02-15 09:46:27
4             5       Comedy 2006-02-15 09:46:27
5             6  Documentary 2006-02-15 09:46:27
6             7        Drama 2006-02-15 09:46:27
7             8       Family 2006-02-15 09:46:27
8             9      Foreign 2006-02-15 09:46:27
9            10        Games 2006-02-15 09:46:27
10           11       Horror 2006-02-15 09:46:27
11           12        Music 2006-02-15 09:46:27
12           13          New 2006-02-15 09:46:27
13           14       Sci-Fi 2006-02-15 09:46:27
14           15       Sports 2006-02-15 09:46:27
15           16       Travel 2006-02-15 09:46:27

**Zadanie 3**

Najmłodszy:

In [22]:

df = pd.read_sql('select * from film order by release_year limit 1',con=connection)
df

c:\Users\kasia\anaconda3\envs\KatarzynaWcislo\lib\site-packages\pandas\io\sql.py:761: UserWarning: pandas only support SQLAlchemy connectable(engine/connection) ordatabase string URI or sqlite3 DBAPI2 connectionother DBAPI2 objects are not tested, please consider using SQLAlchemy
  warnings.warn(

,film_id,title,description,release_year,language_id,rental_duration,rental_rate,length,replacement_cost,rating,last_update,special_features,fulltext
0,133,Chamber Italian,A Fateful Reflection of a Moose And a Husband ...,2006,1,7,4.99,117,14.99,NC-17,2013-05-26 14:50:58.951,[Trailers],'chamber':1 'fate':4 'husband':11 'italian':2 ...

Najstarszy:

In [23]:
df = pd.read_sql('select* from film order by release_year desc limit 1',con=connection)
df

c:\Users\kasia\anaconda3\envs\KatarzynaWcislo\lib\site-packages\pandas\io\sql.py:761: UserWarning: pandas only support SQLAlchemy connectable(engine/connection) ordatabase string URI or sqlite3 DBAPI2 connectionother DBAPI2 objects are not tested, please consider using SQLAlchemy
  warnings.warn(

,film_id,title,description,release_year,language_id,rental_duration,rental_rate,length,replacement_cost,rating,last_update,special_features,fulltext
0,133,Chamber Italian,A Fateful Reflection of a Moose And a Husband ...,2006,1,7,4.99,117,14.99,NC-17,2013-05-26 14:50:58.951,[Trailers],'chamber':1 'fate':4 'husband':11 'italian':2 ...

**Zadanie 4**

In [24]:
df = pd.read_sql("select count(*) from rental where rental_date between '2005-07-01 00:00:00' and '2005-08-01 00:00:00' ",con=connection)
df

c:\Users\kasia\anaconda3\envs\KatarzynaWcislo\lib\site-packages\pandas\io\sql.py:761: UserWarning: pandas only support SQLAlchemy connectable(engine/connection) ordatabase string URI or sqlite3 DBAPI2 connectionother DBAPI2 objects are not tested, please consider using SQLAlchemy
  warnings.warn(

   count
0   6709

**Zdadanie 5**

In [25]:
df = pd.read_sql("select count(*) from rental where rental_date between '2010-01-01 00:00:00' and '2011-02-01 00:00:00' ",con=connection)
df

c:\Users\kasia\anaconda3\envs\KatarzynaWcislo\lib\site-packages\pandas\io\sql.py:761: UserWarning: pandas only support SQLAlchemy connectable(engine/connection) ordatabase string URI or sqlite3 DBAPI2 connectionother DBAPI2 objects are not tested, please consider using SQLAlchemy
  warnings.warn(

   count
0      0

**Zadanie 6**

In [26]:
df = pd.read_sql('select amount from payment order by amount DESC limit 1',con=connection)
print(df)

   amount
0   11.99

c:\Users\kasia\anaconda3\envs\KatarzynaWcislo\lib\site-packages\pandas\io\sql.py:761: UserWarning: pandas only support SQLAlchemy connectable(engine/connection) ordatabase string URI or sqlite3 DBAPI2 connectionother DBAPI2 objects are not tested, please consider using SQLAlchemy
  warnings.warn(

**zadanie 7**

In [27]:
df = pd.read_sql("select customer.customer_id, customer.first_name, customer.last_name, country.country from customer,country, address,city where customer.address_id = address.address_id and address.city_id = city.city_id and city.country_id = country.country_id and  country.country in ('Poland', 'Nigeria', 'Bangladesh')  ", con = connection)
df

c:\Users\kasia\anaconda3\envs\KatarzynaWcislo\lib\site-packages\pandas\io\sql.py:761: UserWarning: pandas only support SQLAlchemy connectable(engine/connection) ordatabase string URI or sqlite3 DBAPI2 connectionother DBAPI2 objects are not tested, please consider using SQLAlchemy
  warnings.warn(

    customer_id first_name  last_name     country
0           284      Sonia    Gregory     Nigeria
1           318      Brian      Wyman      Poland
2           572     Sidney   Burleson      Poland
3           409     Rodney    Moeller     Nigeria
4           332    Stephen     Qualls  Bangladesh
5           286      Velma      Lucas     Nigeria
6            80    Marilyn       Ross     Nigeria
7           198      Elsie     Kelley     Nigeria
8           103     Gladys   Hamilton     Nigeria
9           329      Frank   Waggoner  Bangladesh
10          128   Marjorie     Tucker      Poland
11           18      Carol     Garcia     Nigeria
12          270       Leah     Curtis      Poland
13          501      Ruben      Geary      Poland
14          277       Olga    Jimenez     Nigeria
15          156     Bertha   Ferguson     Nigeria
16          280     Tracey    Barrett     Nigeria
17          250         Jo     Fowler     Nigeria
18          571    Johnnie   Chisholm      Poland
19          562    Wallace      Slone     Nigeria
20           21   Michelle      Clark  Bangladesh
21          380    Russell    Brinson      Poland
22          558     Jimmie  Eggleston      Poland
23          232  Constance       Reid     Nigeria

**Zadanie 8**

In [28]:
df = pd.read_sql("select address.address from staff, address where staff.address_id = address.address_id   ", con = connection)
df

c:\Users\kasia\anaconda3\envs\KatarzynaWcislo\lib\site-packages\pandas\io\sql.py:761: UserWarning: pandas only support SQLAlchemy connectable(engine/connection) ordatabase string URI or sqlite3 DBAPI2 connectionother DBAPI2 objects are not tested, please consider using SQLAlchemy
  warnings.warn(

                address
0     23 Workhaven Lane
1  1411 Lillydale Drive

**Zadanie 9**

In [29]:
df = pd.read_sql("select count(*) from staff, country, address, city where staff.address_id = address.address_id and address.city_id = city.city_id and city.country_id = country.country_id and country.country in ('Spain', 'Argentina') ", con = connection)
df

c:\Users\kasia\anaconda3\envs\KatarzynaWcislo\lib\site-packages\pandas\io\sql.py:761: UserWarning: pandas only support SQLAlchemy connectable(engine/connection) ordatabase string URI or sqlite3 DBAPI2 connectionother DBAPI2 objects are not tested, please consider using SQLAlchemy
  warnings.warn(

   count
0      0

**zadanie 10**

In [30]:
df = pd.read_sql("select distinct category.name from category, rental, inventory, film_category where rental.inventory_id = inventory.inventory_id and inventory.film_id = film_category.film_id and film_category.category_id = category.category_id   ", con = connection)
df

c:\Users\kasia\anaconda3\envs\KatarzynaWcislo\lib\site-packages\pandas\io\sql.py:761: UserWarning: pandas only support SQLAlchemy connectable(engine/connection) ordatabase string URI or sqlite3 DBAPI2 connectionother DBAPI2 objects are not tested, please consider using SQLAlchemy
  warnings.warn(

           name
0        Sports
1      Classics
2           New
3        Family
4        Comedy
5     Animation
6        Travel
7         Music
8         Drama
9        Horror
10       Sci-Fi
11        Games
12  Documentary
13      Foreign
14       Action
15     Children

**Zadanie 11**

In [31]:
df = pd.read_sql("select distinct category.name from category,film, film_category, rental, customer, address, city, country, inventory  where rental.inventory_id = inventory.inventory_id and inventory.film_id = film_category.film_id and film_category.category_id = category.category_id  and rental.customer_id = customer.customer_id and customer.address_id = address.address_id and address.city_id = city.city_id and city.country_id = country.country_id and country.country in ('United States') ", con = connection)
df

c:\Users\kasia\anaconda3\envs\KatarzynaWcislo\lib\site-packages\pandas\io\sql.py:761: UserWarning: pandas only support SQLAlchemy connectable(engine/connection) ordatabase string URI or sqlite3 DBAPI2 connectionother DBAPI2 objects are not tested, please consider using SQLAlchemy
  warnings.warn(

           name
0        Sports
1      Classics
2           New
3        Family
4        Comedy
5     Animation
6        Travel
7         Music
8         Drama
9        Horror
10       Sci-Fi
11        Games
12  Documentary
13      Foreign
14       Action
15     Children

**Zadanie 12**

In [32]:
df = pd.read_sql("select distinct film.title from film, film_actor, actor  where film.film_id = film_actor.film_id and film_actor.actor_id = actor.actor_id and (actor.first_name = 'Olympia' and actor.last_name = 'Pfeiffer' or actor.first_name = 'Julia' and actor.last_name = 'Zellweger' or actor.first_name = 'Ellen' and actor.last_name = 'Presley') ", con = connection)
df

c:\Users\kasia\anaconda3\envs\KatarzynaWcislo\lib\site-packages\pandas\io\sql.py:761: UserWarning: pandas only support SQLAlchemy connectable(engine/connection) ordatabase string URI or sqlite3 DBAPI2 connectionother DBAPI2 objects are not tested, please consider using SQLAlchemy
  warnings.warn(

                   title
0            Badman Dawn
1        Bilko Anonymous
2   Breakfast Goldfinger
3      Caribbean Liberty
4       Casper Dragonfly
..                   ...
64             Turn Star
65            Wait Cider
66          Women Dorado
67             Won Dares
68         Wyoming Storm

[69 rows x 1 columns]